
-- ----------------------------------------------------------------Таск №5 -----------------------------------------------------------

SQL - LIKE
Оператор LIKE використовується в конструкції разом з WHERE як пошук конкретного значення або вибірки.
Прив використанні символа % можна використати наступні уонструкції як 
a% - вибрирка слова що починається з <а>   приклад : Амальгама
%а - вибрирка слова що закінчується на <а> приклад : амальгамА
%a% - вибрирка слова що має в собі значення <а>  приклад: амАльгАма


SQL - JOIN
Оператор JOIN використовується для обєднання декількох таблиць на основі спільного ключового значення яким виступає ключовий ідентифікатор.



SQL - INNER JOIN
Оператор INNER JOIN використовується для вибірки та відображення даних що є ідентичними та їх ключові ідентифікатори є ідентичними.



SQL - LEFT JOIN
Оператор LEFT JOIN повертає всі значення першої таблиці та спільні в таблиці 2  ,а такі які не є спільними відображаються як null тобто рівність між ними відповідає false і занулюються.



SQL - RIGHT JOIN
Оператор RIGHT JOIN повертає всі значення другої таблиці , та спільні в таблиці 1 а такі які не є спільними відображаються як null тобто рівність між ними відповідає false і занулюються.


SQL - FULL OUTER JOIN
Опертатор FULL OUTER JOIN повертає спільні значення двух співставлених таблиць , та спільні значення з JOIN LEFT та JOIN RIGHT а їх невідповідність відображаються як null.


SQL - UNION
Оператор UNION используется для объединения результирующего набора из двух или более заявлений SELECT.



SQL - WHERE
Опертор WHERE використовується як фільтратор для витягу конкретних значень з колонки таблиці.


SQL - AND, OR, NOT
Оператори AND, OR, NOT використовуються як додатки до оператора WHERE для витягу конкретики даних:
AND - даний оператор прописується у випадку якщо необхідно відобразити більше 1 значення з різних таблиць або БД 
OR - даний оператор прописується у випадку якщо необхідно відобрачити всі значення true з різних таблиць або БД 
NOT - Відображає невідповідні значення false в базах даних.
